       IDENTIFICATION DIVISION.
       PROGRAM-ID. HIGHEST-LOWEST-NUMBER.
       AUTHOR. JOSE-VILCA.

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.    
       01  WS-NUMBER-1     PIC 9(10).
       01  WS-NUMBER-2     PIC 9(10).

       01  WS-HIGHEST      PIC 9(10)   VALUE 0.
       01  WS-LOWEST       PIC 9(10)   VALUE 0.

       01  WS-RESULT-HIGHEST       PIC Z(10).
       01  WS-RESULT-LOWEST       PIC Z(10).


       PROCEDURE DIVISION.
       
       MAIN-PROCEDURE.
           PERFORM INGRESAR-DATOS.
           PERFORM COMPARAR-NUMERO.
           PERFORM MOSTRAR-RESULTADO.
           STOP RUN.
       COMPARAR-NUMERO.
           IF WS-NUMBER-1 > WS-NUMBER-2
               MOVE WS-NUMBER-1 TO WS-HIGHEST
               MOVE WS-NUMBER-2 TO WS-LOWEST
           ELSE 
               MOVE WS-NUMBER-2 TO WS-HIGHEST
               MOVE WS-NUMBER-1 TO WS-LOWEST
           END-IF.

       INGRESAR-DATOS.
           DISPLAY "INGRESE NUMERO 1:"
           ACCEPT WS-NUMBER-1
           DISPLAY "INGRESE NUMERO 2:"
           ACCEPT WS-NUMBER-2.

       MOSTRAR-RESULTADO.
           MOVE WS-HIGHEST TO WS-RESULT-HIGHEST
           MOVE WS-LOWEST TO WS-RESULT-LOWEST
           DISPLAY "EL NUMERO MAYOR ES:" WS-RESULT-HIGHEST
           DISPLAY "EL NUMERO MENOR ES:" WS-RESULT-LOWEST



       
